RhinoInside.Revit API Documentation
GeometryDecoder.ToVector2d Method
 Converts the specified Autodesk.Revit.DB.UV to an equivalent Rhino.Geometry.Vector2d.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Rhino.Geometry.Vector2d ToVector2d(
	this Autodesk.Revit.DB.UV uvPoint
)
@staticmethod
def ToVector2d(
	uvPoint: Autodesk.Revit.DB.UV
) -> Rhino.Geometry.Vector2d
Parameters
uvPoint
Type: Autodesk.Revit.DB.UV
Revit uvPoint to convert.
Return Value
Type: Rhino.Geometry.Vector2d
Rhino vector that is equivalent to the provided Revit uvPoint.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.UV. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToVector2d(UV) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Vector2d rhinoVector2d = revitUvPoint.ToVector2d();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_vector2d = revit_uvpoint.ToVector2d() # type: RG.Vector2d
 Using ToVector2d(UV) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Vector2d rhinoVector2d = GeometryEncoder.ToVector2d(revitUvPoint)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_vector2d = GD.ToVector2d(revit_uvpoint) # type: RG.Point2d
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace